{"filename": "FDCVMidhunPolisetty", "pages": [{"page_n": "1", "p_content": "  Page 1 of  3 Midhun Polisetty   Profile  Service driven Professional in System and Platform Engineering with reputation in planning, designing, creative problem solving and effective resource management. With increased adoption of BIG data and platform end to end design and solution implementations in traditional enterprises my objective is to seek a challenging role that encourages continuous development with both personal and professional growth.  Technical Skills: UNIX, RHEL, SQL, Installation, Configuration, Cluster Admin of Confluent Kafka Platform, Replication between DC’s, Schema HA, Confluent Control Center and HDP Big data components HDFS, YARN, Sqoop, Hive, Oozie, HBase, Zeppelin, Spark, Zookeeper, Ranger and Ranger KMS. TIBCO IBI Web FOCUS, SSO. Experience in Open LDAP, Kerberos, Dataiku, OpenShift, Talend, Ansible, Jenkins, Docker, KSQL, AKAMAI CDN. Lead multiple Projects to Migrate legacy applications to Distributed platforms, experience in Cloud including Azure, AWS, MPP DWH like Yellowbrick. Administration and integration of stream processing applications. Microsoft Office (Excel/VBA, Word, PowerPoint, Outlook). Cloudera data platform CDP. Autoscaling, Azure Traffic Manager, Azure Load balancer, CloudLink, Kafka Streams, AWS Route 53, AWS S3, AWS CloudFront, Kubernetes, SQS, SNS   Professional Accomplishments  First Derivatives plc Lead Technical Architect/Solution Architect                                                                       (Apr’22-Present) • Providing Architect solutions for Performance tunning on BIG DATA Platforms  • Provide R&D for Crypto Roadmaps relevant to Confluent Kafka and Other Big data Components.  • Conduct workshops with Clients, Product Owners for Identifying scope of work • Review AWS, Azure Architecture designs and suggest best availability, durable and Operational Practices.  • Ability to translate Traditional IT infrastructure to global cloud deployments • Develop Architecture blueprints, detailed documentation for required cloud services and tools  ACI Worldwide Principal Bigdata Engineer/Technical Architect                                                                   (Mar’21-Apr’22)    Senior Bigdata Engineer                                                                                                           (Apr’17-Feb’21) • Installing, configuring, Upgrading, cluster tunning and develop deployment models for distributed platforms like Hortonworks Data Platform, Confluent Kafka Platform, TIBCO IBI, Yellow brick DWH, Talend, OpenShift, Spark along with DevOps models. • Technical Architect for Confluent Kafka layout, service Principal layout form front end to back end, Implantation of encryption, security, Configuring Replication Between DC’s, Schema evaluations and HA setups, streaming Integration with front end and back-end pools.  • Design and develop Failover strategy across data centers at back end and front-end Application layer and Control Centers. • Experience in Leading On-premises and Hybrid Cloud migration, Develop Lift and shift methods for Distributed platforms/Confluent Kafka. • Initiated cloud vison and provided technical guidance on building solutions using Azure and AWS IaaS, SaaS and PaaS. • Ensuring End to End component layouts, Integration of New technology patterns designed to high technical standards.  • Responsible for leading Projects in HDP, CDP, KSQL, Kafka connect, Kafka, Hadoop, wallet share Projects to choose correct approach based on enterprise requirements.  • Responsible for accessing appropriate technologies to meet High availability and resiliency.   \f"}, {"page_n": "2", "p_content": "  Page 2 of  3 • Securing clusters/servers with Ranger Authorization and Kerberos Authentication.  • Implementation of AKAMAI CDN for cyber security and edge computing.  • Experience in LDAP integration with distributed platforms, redundancy, Platform Upgrades and Jenkin Pipeline Models for deployments.  • Lead Poc for Migration of on-prem spark to Kubernetes on cloud (EKS) with Apache Airflow workflow management system. • lead Sybase to YB data migration, Postgres Active/Passive setup in HDP cluster for High availability. • Worked on decoupled architecture to allow components operate independently while communication each other.  • Working knowledge with HDP components HDFS, Yarn, HBase, Oozie, Zeppelin  • Implemented JMX monitoring and integrate with Zabbix for component monitoring.  • Design Benchmarking for distributed clusters with to access performance for read and writes.  • Get the requirements and develop solution methodology to ensure application in support. • Exposure to Pan Intelligence Integration with HDP and DataStax Solr on Cassandra. • Managed Engineering team and been a Tech lead for Multiple big data Projects  Capgemini – Lead Bigdata Platform Engineer                                                                      (Apr’16-Mar’17) • Distributed clusters capacity planning, performance tuning & troubleshooting configure HA on Amazon web services (AWS). • Configuration and implementation of Data in Rest and data in transition for various platforms. • Pivotal Greenplum installation, operation, over Docker containers, Ambari, infra Solr, planning security and Auditing for platforms.  • Responsible for RHEL server builds on AWS cloud environment, software installations, Monitoring, HDP Hadoop cluster performance, File system Management, Access Management, and user administration.   Insure the box – Application Support Analyst                                                                       (Nov’13-Mar’16) • Responsible for development, implementation and supporting MapR 4.0 Hadoop clusters and deploying new hardware, administer infrastructure.  • Hadoop Data Replication, backups and Disaster recovery procedure and system integration with Active directory and configuring an operational monitoring. BT Global Service – SSOC Support Analyst                                                                            (Oct’12-Oct’13)  • Experience in Installing and Administering Microsoft sever 2008/2012 (Active directory Integrated DNS/DHCP, Active directory infrastructure, Distributed file system), Exchange server 2010, SQL server 2008 R2 and responsible for managing Incident progression and ensure ITIL and ISO20000\\27001 best practices are adopted. Serco – Systems Administrator                                                                                                 (Jan’10-Sep’12) • Managing windows and Linux System infrastructure including monitoring, maintaining architecture and configuration of Linux servers  Blue Vega Solutions – Network Engineer                                                                               (Aug’08-Dec’09) • Responsible for Configuring, implementing security policies and maintaining/troubleshoot Cisco switches and L3, 2k Series routers.  Education & Training  Northumbria University  Master of science in Computer Network Technology   Anna University  Bachelor of Engineering in Electronics and Communications   Certifications:   \f"}, {"page_n": "3", "p_content": "  Page 3 of  3 • AWS Certified Solutions Architect -Associate https://www.credly.com/badges/92412a4c-a737-4523-ba80-9a7699bddd44/public_url  • Microsoft Certified Azure Solutions Architect Expert https://www.credly.com/go/Cn6FoMmElezc2OeL5aRZzQ • Microsoft Certified Azure Fundamentals.  • Confluent Certified Administrator for Apache Kafka. • Akamai Web Performance Foundations. • MCHA MapR Certified Hadoop Administrator. • Hortonworks Data Platform /HDP Operations. • Information Technology Infrastructure Library (ITIL V3 Foundation). • Microsoft Certified Systems Engineer in Windows 2003 (MCP). • Cisco Certified Network Associate (CCNA). • Solaris 10 OS part 1 & part 2. • Pivotal Greenplum Administration. • M20462 Administering Microsoft SQL Server Databases \f"}]}